<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"7398b01a28b72ea50b16023c1ccd7c90761b1f85948cf35fa47986acf7306677","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #555 at https://github.com/cal-itp/data-infra/actions/runs/17505293809","plan_out_hash":"145e5769d228872dff67085e542a1d6d416510a1aa926c66b980cbfab80a70b1","plan_hash":"3651d72c293e24c2848d4a6a7d8673c0eda5f048f602e202a552fd3375121201","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer["dags/create_external_tables/ntd_data_products/historical__complete_monthly_ridership_with_adjustments_and_estimates.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/create_external_tables/ntd_data_products/historical__complete_monthly_ridership_with_adjustments_and_estimates.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/create_external_tables/ntd_data_products/historical__complete_monthly_ridership_with_adjustments_and_estimates.yml"
+       storage_class  = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #555](https://github.com/cal-itp/data-infra/actions/runs/17505293809)